Revit 2026 API

# LightTypeGetLightType Method

---

Creates a light type object from the given document and family type ID

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LightType GetLightType(
	Document document,
	ElementId typeId
)
```
```vb
Public Shared Function GetLightType (
	document As Document,
	typeId As ElementId
) As LightType
```
```cpp
public:
static LightType^ GetLightType(
	Document^ document,
	ElementId^ typeId
)
```
```fsharp
static member GetLightType :
        document : Document *
        typeId : ElementId -> LightType
```

#### Parameters

document Document
     The document the typeId is from
typeId ElementId
     The ID of the light family type

#### Return Value

LightType The newly created LightType object

| Exception | Condition |
| --- | --- |
| ArgumentException | The ElementId is the argument that is being validated The ElementId is not valid because it is not for a light element. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LightType Class

Autodesk.Revit.DB.Lighting Namespace